# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [1]:
#Your code here; import the necessary packages
import tpclean.tpclean as tp

In [2]:
#Your code here; create the connection and cursor
tp.sql_connect("data.sqlite")

Connection to data.sqlite successfull. with curser <sqlite3.Cursor object at 0x1a216afea0>

In [3]:
tp.sql("""select * from sqlite_master""")

,type,name,tbl_name,rootpage,sql
0,table,orderdetails,orderdetails,2,"CREATE TABLE `orderdetails` (`orderNumber`, `p..."
1,table,payments,payments,28,"CREATE TABLE `payments` (`customerNumber`, `ch..."
2,table,offices,offices,32,"CREATE TABLE `offices` (`officeCode`, `city`, ..."
3,table,customers,customers,33,"CREATE TABLE `customers` (`customerNumber`, `c..."
4,table,orders,orders,38,"CREATE TABLE `orders` (`orderNumber`, `orderDa..."
5,table,productlines,productlines,46,"CREATE TABLE `productlines` (`productLine`, `t..."
6,table,products,products,47,"CREATE TABLE `products` (`productCode`, `produ..."
7,table,employees,employees,56,"CREATE TABLE `employees` (`employeeNumber`, `l..."

## Select the Average Number of Orders on a Product by Product Basis

In [4]:
#Your code here; use a subquery. No join will be necessary.
tp.sql("""select AVG(orders) from 
                                (select productCode , count(orderNumber) as orders
                                        from orderdetails
                                        group by productcode)""")

   AVG(orders)
0    27.486239

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [5]:
tp.sql("""select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';"""
      )

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

In [6]:
#Your code here; use a subquery. No join will be necessary.
tp.sql("""select   customerNumber,
                   contactLastName,
                   contactFirstName
                   from customers
                   where customerNumber = (
                           select customerNumber from orders
                           where orderdate = '2003-01-31'
                   )""")

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [20]:
#Your code here
tp.sql("""select productName,orders,total_sold
                from products join 
                                (select productCode, count(orderNumber) as orders ,sum(quantityOrdered) as total_sold
                                        from orderdetails
                                        group by productCode)
                            using(productCode)
                            order by total_sold desc
                                        
                                        """).head()

                               productName  orders  total_sold
0              1992 Ferrari 360 Spider red      53        1808
1                     1937 Lincoln Berline      28        1111
2                American Airlines: MD-11S      28        1085
3  1941 Chevrolet Special Deluxe Cabriolet      28        1076
4             1930 Buick Marquette Phaeton      28        1074

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [ ]:
#
#I got the point and will come back later

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
#Your code here

#I got the point and will come back later

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [ ]:
#Your code here

#I got the point and will come back later

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!